In [1]:
import pandas as pd

In [4]:
ch = pd.read_table("http://bit.ly/chiporders")

In [5]:
ch.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [23]:
user_cols = ["user_id", "age", "gender","occupation", "zip_code"]
users = pd.read_table("http://bit.ly/movieusers","|",header=None, names=user_cols)

In [24]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [28]:
import os
os.getcwd()

'/home/kokdemir/development/python/pandas-videos'